In [17]:
import pandas as pd

df=pd.read_csv("C:/Users/jabba/Downloads/students.csv")
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago
4      Eve   25       New York
5    Frank   28         Boston
6    Grace   22  San Francisco
7    Helen   32    Los Angeles
8      Ivy   29        Chicago
9     Jack   26       New York

In [53]:
# filtering on city give us SF only
sf_filter = df['City'] == 'San Francisco'

SF_count = df[sf_filter].agg({"Name":"count"})
SF_count

Name    2
dtype: int64

In [52]:
chi_filter = df['City'] == 'Chicago'
Chi_Avg = df[sf_filter].agg({"Age":"mean"})
Chi_Avg

Age    26.0
dtype: float64

In [56]:
age_filter = df['Age'] >= 30
over_30_table = df[age_filter]#.agg({"Name":"count"})
over_30_table

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago
7    Helen   32    Los Angeles

In [38]:
# we can also passed this into a groupby and compute the sum 
df.groupby('City').agg({"Age":"sum"})

               Age
City
Boston          28
Chicago         69
Los Angeles     67
New York        76
San Francisco   52

In [63]:
test = df['City'] == "Boston"
df[test]

    Name  Age    City
5  Frank   28  Boston

In [69]:
# we can make a function called filter_dataframe which returns
# This function takes three arguments: 
# a Pandas DataFrame, 
# a column name, 
# and a filter value. 
# It returns a new DataFrame containing only the rows where the 
# specified column's value matches the given filter value.  

def filter_dataframe(df,name,cutoff):
     my_filter = df[name] == cutoff
     my_filtered_table = df[my_filter]
     return(my_filtered_table)
    

filter_dataframe(df=df,name = 'City' ,cutoff = 'Boston')

    Name  Age    City
5  Frank   28  Boston